f4exb/tnc1101/MSP430_USB_API/driverlib/MSP430F5xx_6xx/deprecated/sysctl.h
//*****************************************************************************
//
// The following are deprecated API names. These were updated to new names to
// add compatibility across Texas Instruments microcontrollers.
//
//*****************************************************************************
#ifndef DEPRECATED
#define SYS_enableDedicatedJTAGPins              SysCtl_enableDedicatedJTAGPins
#define SYS_getBSLEntryIndication                  SysCtl_getBSLEntryIndication
#define SYS_enablePMMAccessProtect                SysCtl_enablePMMAccessProtect
#define SYS_enableRAMBasedInterruptVectors                                    \
                                          SysCtl_enableRAMBasedInterruptVectors
#define SYS_disableRAMBasedInterruptVectors                                   \
                                         SysCtl_disableRAMBasedInterruptVectors
#define SYS_enableBSLProtect                            SysCtl_enableBSLProtect
#define SYS_disableBSLProtect                          SysCtl_disableBSLProtect
#define SYS_enableBSLMemory                              SysCtl_enableBSLMemory
#define SYS_disableBSLMemory                            SysCtl_disableBSLMemory
#define SYS_setRAMAssignedToBSL                      SysCtl_setRAMAssignedToBSL
#define SYS_setBSLSize                                        SysCtl_setBSLSize
#define SYS_JTAGMailboxInit                              SysCtl_JTAGMailboxInit
#define SYS_getJTAGMailboxFlagStatus            SysCtl_getJTAGMailboxFlagStatus
#define SYS_clearJTAGMailboxFlagStatus        SysCtl_clearJTAGMailboxFlagStatus
#define SYS_getJTAGInboxMessage16Bit            SysCtl_getJTAGInboxMessage16Bit
#define SYS_getJTAGInboxMessage32Bit            SysCtl_getJTAGInboxMessage32Bit
#define SYS_setJTAGOutgoingMessage16Bit      SysCtl_setJTAGOutgoingMessage16Bit
#define SYS_setJTAGOutgoingMessage32Bit      SysCtl_setJTAGOutgoingMessage32Bit
#endif

//*****************************************************************************
//
// The following are deprecated struct names. These were updated to new names
// to add compatibility across Texas Instruments microcontrollers.
//
//*****************************************************************************
#ifndef DEPRECATED
#endif

//*****************************************************************************
//
// Mark the end of the C bindings section for C++ compilers.
//
//*****************************************************************************
#ifdef __cplusplus
}
#endif

#endif
#endif // __MSP430WARE_SYSCTL_H__
//Released_Version_4_20_00
